app/views/albums/edit.html.erb

SELECT COUNT(*) FROM `photos` WHERE (`photos`.album_id = 4)
SELECT `photos`.* FROM `photos` WHERE (`photos`.album_id = 4)
---
    <legend>Fotos</legend>
    <% if @album.photos.empty? %>